TIER_LIST = [
    "아이언", "브론즈", "실버",
    "골드", "플래티넘", "에메랄드", "다이아", "마스터"
]

POSITIONS = [
    "탑", "정글", "미드", "원딜", "서폿"
]

ANY_POSITION = "상관없음"

POSITION_OPTIONS = [
    ANY_POSITION,
    *POSITIONS,
]

DEFAULT_TIER_SCORE = {
    "아이언": 1,
    "브론즈": 2,
    "실버": 3,
    "골드": 4,
    "플래티넘": 5,
    "에메랄드": 6,
    "다이아": 7,
    "마스터": 8
}

TIER_COLOR = {
    "아이언": "#6e6e6e",
    "브론즈": "#b87333",
    "실버": "#c0c0c0",
    "골드": "#ffd700",
    "플래티넘": "#00d4aa",
    "에메랄드": "#2eccb0",
    "다이아": "#4da6ff",
    "마스터": "#b84dff"
}
